#include "Flash/flash_esp32.h"
#include "Print/print_task.h"
// #include "..\..\BOOT\Application\flash_allot_table.h"

#define FMC_PAGE_SIZE           FLASH_PAGE_SIZE

/*****************************************************************************************************************
-----函数功能    flash擦除函数
-----说明(备注)  注意G4系列，单 bank 分区一次擦写最小单位为4KB，双 bank 分区一次擦写最小单位为2KB
-----传入参数    none
-----输出参数    none
-----返回值      none
*****************************************************************************************************************/
bool bFlash_Esp32EraseSector(uint32_t StartAddr,uint32_t EndAddr)
{
	return true;
}

/*****************************************************************************************************************
-----函数功能    flash 写入函数,按32位写入
-----说明(备注)  none
-----传入参数    Addr:开始地址    Data:数据    Num:8Bit长度
-----输出参数    none
-----返回值      none
*****************************************************************************************************************/
bool bFlash_Esp32Write8Bit(uint32_t WriteAddr,const uint8_t *wData,uint32_t wNum)
{
	return true;
}

/*****************************************************************************************************************
-----函数功能    flash 读取函数,按8位读取
-----说明(备注)  none
-----传入参数    ReadAddr:开始地址    rData:数据    rNum:8Bit长度
-----输出参数    none
-----返回值      none
*****************************************************************************************************************/
void vFlash_Esp32Read8Bit(uint32_t ReadAddr,uint8_t *rData,uint32_t rNum)
{
	return;
}
